app/views/lists/show.html.erb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."list_id" = $1  [["list_id", 3]]
---
	<div class="container-movies">
	  <% @list.bookmarks.each do |bookmark| %>