app/views/bookmarks/new.html.erb

SELECT "movies".* FROM "movies"
---
  <div>
	<%= form.input :movie_id, collection: Movie.all, label_method: :title, value_method: :id, label: "Film", prompt: "Sélectionnez un film" %>