app/controllers/bookmarks_controller.rb

	def new
		@list = List.find(params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def create
		@list = List.find(params[:list_id])
		@bookmark = @list.bookmarks.build(bookmark_params)
		if @bookmark.save
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("movie_id", "list_id", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["movie_id", 20], ["list_id", 1], ["comment", "Gros navet"], ["created_at", "2024-10-21 19:01:09.572790"], ["updated_at", "2024-10-21 19:01:09.572790"]]

	def destroy
		@bookmark = Bookmark.find(params[:id])
		@list = @bookmark.list
		@bookmark.destroy
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 19]]