app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "lists" SET "name" = $1, "updated_at" = $2 WHERE "lists"."id" = $3  [["name", "Moutons"], ["updated_at", "2024-10-21 18:06:17.074002"], ["id", 2]]
---
	def update
		@list = List.find(params[:id])

		if @list.update(list_params)

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2024-10-21 17:59:22.138564"], ["updated_at", "2024-10-21 17:59:22.138564"]]
---
	def create
		@list = List.new(list_params)
		if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = $1  [["id", 2]]
---
	def destroy
		@list = List.find(params[:id])
		@list.destroy